Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 256, 256, 3) 0                                            
__________________________________________________________________________________________________
Conv1_pad (ZeroPadding2D)       (None, 257, 257, 3)  0           input_2[0][0]                    
__________________________________________________________________________________________________
Conv1 (Conv2D)                  (None, 128, 128, 24) 648         Conv1_pad[1][0]                  
__________________________________________________________________________________________________
bn_Conv1 (BatchNormalization)   (None, 128, 128, 24) 96          Conv1[1][0]                      
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 128, 128, 24) 0           bn_Conv1[1][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 128, 128, 24) 0           re_lu[0][0]                      
__________________________________________________________________________________________________
expanded_conv_depthwise (Depthw (None, 128, 128, 24) 216         dropout[0][0]                    
__________________________________________________________________________________________________
expanded_conv_depthwise_BN (Bat (None, 128, 128, 24) 96          expanded_conv_depthwise[1][0]    
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 128, 128, 24) 0           expanded_conv_depthwise_BN[1][0] 
__________________________________________________________________________________________________
expanded_conv_project (Conv2D)  (None, 128, 128, 16) 384         re_lu_1[0][0]                    
__________________________________________________________________________________________________
expanded_conv_project_BN (Batch (None, 128, 128, 16) 64          expanded_conv_project[1][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128, 128, 16) 0           expanded_conv_project_BN[1][0]   
__________________________________________________________________________________________________
block_1_expand (Conv2D)         (None, 128, 128, 96) 1536        dropout_1[0][0]                  
__________________________________________________________________________________________________
block_1_expand_BN (BatchNormali (None, 128, 128, 96) 384         block_1_expand[1][0]             
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 128, 128, 96) 0           block_1_expand_BN[1][0]          
__________________________________________________________________________________________________
block_1_pad (ZeroPadding2D)     (None, 129, 129, 96) 0           re_lu_2[0][0]                    
__________________________________________________________________________________________________
block_1_depthwise (DepthwiseCon (None, 64, 64, 96)   864         block_1_pad[1][0]                
__________________________________________________________________________________________________
block_1_depthwise_BN (BatchNorm (None, 64, 64, 96)   384         block_1_depthwise[1][0]          
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 64, 64, 96)   0           block_1_depthwise_BN[1][0]       
__________________________________________________________________________________________________
block_1_project (Conv2D)        (None, 64, 64, 24)   2304        re_lu_3[0][0]                    
__________________________________________________________________________________________________
block_1_project_BN (BatchNormal (None, 64, 64, 24)   96          block_1_project[1][0]            
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 64, 64, 24)   0           block_1_project_BN[1][0]         
__________________________________________________________________________________________________
block_2_expand (Conv2D)         (None, 64, 64, 144)  3456        dropout_2[0][0]                  
__________________________________________________________________________________________________
block_2_expand_BN (BatchNormali (None, 64, 64, 144)  576         block_2_expand[1][0]             
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 64, 64, 144)  0           block_2_expand_BN[1][0]          
__________________________________________________________________________________________________
block_2_depthwise (DepthwiseCon (None, 64, 64, 144)  1296        re_lu_4[0][0]                    
__________________________________________________________________________________________________
block_2_depthwise_BN (BatchNorm (None, 64, 64, 144)  576         block_2_depthwise[1][0]          
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 64, 64, 144)  0           block_2_depthwise_BN[1][0]       
__________________________________________________________________________________________________
block_2_project (Conv2D)        (None, 64, 64, 24)   3456        re_lu_5[0][0]                    
__________________________________________________________________________________________________
block_2_project_BN (BatchNormal (None, 64, 64, 24)   96          block_2_project[1][0]            
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 64, 64, 24)   0           block_2_project_BN[1][0]         
__________________________________________________________________________________________________
block_2_add (Add)               (None, 64, 64, 24)   0           dropout_3[0][0]                  
                                                                 dropout_2[0][0]                  
__________________________________________________________________________________________________
block_3_expand (Conv2D)         (None, 64, 64, 144)  3456        block_2_add[1][0]                
__________________________________________________________________________________________________
block_3_expand_BN (BatchNormali (None, 64, 64, 144)  576         block_3_expand[1][0]             
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 64, 64, 144)  0           block_3_expand_BN[1][0]          
__________________________________________________________________________________________________
block_3_pad (ZeroPadding2D)     (None, 65, 65, 144)  0           re_lu_6[0][0]                    
__________________________________________________________________________________________________
block_3_depthwise (DepthwiseCon (None, 32, 32, 144)  1296        block_3_pad[1][0]                
__________________________________________________________________________________________________
block_3_depthwise_BN (BatchNorm (None, 32, 32, 144)  576         block_3_depthwise[1][0]          
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 32, 32, 144)  0           block_3_depthwise_BN[1][0]       
__________________________________________________________________________________________________
block_3_project (Conv2D)        (None, 32, 32, 24)   3456        re_lu_7[0][0]                    
__________________________________________________________________________________________________
block_3_project_BN (BatchNormal (None, 32, 32, 24)   96          block_3_project[1][0]            
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 32, 32, 24)   0           block_3_project_BN[1][0]         
__________________________________________________________________________________________________
block_4_expand (Conv2D)         (None, 32, 32, 144)  3456        dropout_4[0][0]                  
__________________________________________________________________________________________________
block_4_expand_BN (BatchNormali (None, 32, 32, 144)  576         block_4_expand[1][0]             
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 32, 32, 144)  0           block_4_expand_BN[1][0]          
__________________________________________________________________________________________________
block_4_depthwise (DepthwiseCon (None, 32, 32, 144)  1296        re_lu_8[0][0]                    
__________________________________________________________________________________________________
block_4_depthwise_BN (BatchNorm (None, 32, 32, 144)  576         block_4_depthwise[1][0]          
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 32, 32, 144)  0           block_4_depthwise_BN[1][0]       
__________________________________________________________________________________________________
block_4_project (Conv2D)        (None, 32, 32, 24)   3456        re_lu_9[0][0]                    
__________________________________________________________________________________________________
block_4_project_BN (BatchNormal (None, 32, 32, 24)   96          block_4_project[1][0]            
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 32, 32, 24)   0           block_4_project_BN[1][0]         
__________________________________________________________________________________________________
block_4_add (Add)               (None, 32, 32, 24)   0           dropout_5[0][0]                  
                                                                 dropout_4[0][0]                  
__________________________________________________________________________________________________
block_5_expand (Conv2D)         (None, 32, 32, 144)  3456        block_4_add[1][0]                
__________________________________________________________________________________________________
block_5_expand_BN (BatchNormali (None, 32, 32, 144)  576         block_5_expand[1][0]             
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 32, 32, 144)  0           block_5_expand_BN[1][0]          
__________________________________________________________________________________________________
block_5_depthwise (DepthwiseCon (None, 32, 32, 144)  1296        re_lu_10[0][0]                   
__________________________________________________________________________________________________
block_5_depthwise_BN (BatchNorm (None, 32, 32, 144)  576         block_5_depthwise[1][0]          
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 32, 32, 144)  0           block_5_depthwise_BN[1][0]       
__________________________________________________________________________________________________
block_5_project (Conv2D)        (None, 32, 32, 24)   3456        re_lu_11[0][0]                   
__________________________________________________________________________________________________
block_5_project_BN (BatchNormal (None, 32, 32, 24)   96          block_5_project[1][0]            
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 32, 32, 24)   0           block_5_project_BN[1][0]         
__________________________________________________________________________________________________
block_5_add (Add)               (None, 32, 32, 24)   0           dropout_6[0][0]                  
                                                                 block_4_add[1][0]                
__________________________________________________________________________________________________
block_6_expand (Conv2D)         (None, 32, 32, 144)  3456        block_5_add[1][0]                
__________________________________________________________________________________________________
block_6_expand_BN (BatchNormali (None, 32, 32, 144)  576         block_6_expand[1][0]             
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 32, 32, 144)  0           block_6_expand_BN[1][0]          
__________________________________________________________________________________________________
block_6_pad (ZeroPadding2D)     (None, 33, 33, 144)  0           re_lu_12[0][0]                   
__________________________________________________________________________________________________
block_6_depthwise (DepthwiseCon (None, 16, 16, 144)  1296        block_6_pad[1][0]                
__________________________________________________________________________________________________
block_6_depthwise_BN (BatchNorm (None, 16, 16, 144)  576         block_6_depthwise[1][0]          
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 16, 16, 144)  0           block_6_depthwise_BN[1][0]       
__________________________________________________________________________________________________
block_6_project (Conv2D)        (None, 16, 16, 48)   6912        re_lu_13[0][0]                   
__________________________________________________________________________________________________
block_6_project_BN (BatchNormal (None, 16, 16, 48)   192         block_6_project[1][0]            
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 16, 16, 48)   0           block_6_project_BN[1][0]         
__________________________________________________________________________________________________
block_7_expand (Conv2D)         (None, 16, 16, 288)  13824       dropout_7[0][0]                  
__________________________________________________________________________________________________
block_7_expand_BN (BatchNormali (None, 16, 16, 288)  1152        block_7_expand[1][0]             
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 16, 16, 288)  0           block_7_expand_BN[1][0]          
__________________________________________________________________________________________________
block_7_depthwise (DepthwiseCon (None, 16, 16, 288)  2592        re_lu_14[0][0]                   
__________________________________________________________________________________________________
block_7_depthwise_BN (BatchNorm (None, 16, 16, 288)  1152        block_7_depthwise[1][0]          
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 16, 16, 288)  0           block_7_depthwise_BN[1][0]       
__________________________________________________________________________________________________
block_7_project (Conv2D)        (None, 16, 16, 48)   13824       re_lu_15[0][0]                   
__________________________________________________________________________________________________
block_7_project_BN (BatchNormal (None, 16, 16, 48)   192         block_7_project[1][0]            
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 16, 16, 48)   0           block_7_project_BN[1][0]         
__________________________________________________________________________________________________
block_7_add (Add)               (None, 16, 16, 48)   0           dropout_8[0][0]                  
                                                                 dropout_7[0][0]                  
__________________________________________________________________________________________________
block_8_expand (Conv2D)         (None, 16, 16, 288)  13824       block_7_add[1][0]                
__________________________________________________________________________________________________
block_8_expand_BN (BatchNormali (None, 16, 16, 288)  1152        block_8_expand[1][0]             
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, 16, 16, 288)  0           block_8_expand_BN[1][0]          
__________________________________________________________________________________________________
block_8_depthwise (DepthwiseCon (None, 16, 16, 288)  2592        re_lu_16[0][0]                   
__________________________________________________________________________________________________
block_8_depthwise_BN (BatchNorm (None, 16, 16, 288)  1152        block_8_depthwise[1][0]          
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 16, 16, 288)  0           block_8_depthwise_BN[1][0]       
__________________________________________________________________________________________________
block_8_project (Conv2D)        (None, 16, 16, 48)   13824       re_lu_17[0][0]                   
__________________________________________________________________________________________________
block_8_project_BN (BatchNormal (None, 16, 16, 48)   192         block_8_project[1][0]            
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 16, 16, 48)   0           block_8_project_BN[1][0]         
__________________________________________________________________________________________________
block_8_add (Add)               (None, 16, 16, 48)   0           dropout_9[0][0]                  
                                                                 block_7_add[1][0]                
__________________________________________________________________________________________________
block_9_expand (Conv2D)         (None, 16, 16, 288)  13824       block_8_add[1][0]                
__________________________________________________________________________________________________
block_9_expand_BN (BatchNormali (None, 16, 16, 288)  1152        block_9_expand[1][0]             
__________________________________________________________________________________________________
re_lu_18 (ReLU)                 (None, 16, 16, 288)  0           block_9_expand_BN[1][0]          
__________________________________________________________________________________________________
block_9_depthwise (DepthwiseCon (None, 16, 16, 288)  2592        re_lu_18[0][0]                   
__________________________________________________________________________________________________
block_9_depthwise_BN (BatchNorm (None, 16, 16, 288)  1152        block_9_depthwise[1][0]          
__________________________________________________________________________________________________
re_lu_19 (ReLU)                 (None, 16, 16, 288)  0           block_9_depthwise_BN[1][0]       
__________________________________________________________________________________________________
block_9_project (Conv2D)        (None, 16, 16, 48)   13824       re_lu_19[0][0]                   
__________________________________________________________________________________________________
block_9_project_BN (BatchNormal (None, 16, 16, 48)   192         block_9_project[1][0]            
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 16, 16, 48)   0           block_9_project_BN[1][0]         
__________________________________________________________________________________________________
block_9_add (Add)               (None, 16, 16, 48)   0           dropout_10[0][0]                 
                                                                 block_8_add[1][0]                
__________________________________________________________________________________________________
block_10_expand (Conv2D)        (None, 16, 16, 288)  13824       block_9_add[1][0]                
__________________________________________________________________________________________________
block_10_expand_BN (BatchNormal (None, 16, 16, 288)  1152        block_10_expand[1][0]            
__________________________________________________________________________________________________
re_lu_20 (ReLU)                 (None, 16, 16, 288)  0           block_10_expand_BN[1][0]         
__________________________________________________________________________________________________
block_10_depthwise (DepthwiseCo (None, 16, 16, 288)  2592        re_lu_20[0][0]                   
__________________________________________________________________________________________________
block_10_depthwise_BN (BatchNor (None, 16, 16, 288)  1152        block_10_depthwise[1][0]         
__________________________________________________________________________________________________
re_lu_21 (ReLU)                 (None, 16, 16, 288)  0           block_10_depthwise_BN[1][0]      
__________________________________________________________________________________________________
block_10_project (Conv2D)       (None, 16, 16, 72)   20736       re_lu_21[0][0]                   
__________________________________________________________________________________________________
block_10_project_BN (BatchNorma (None, 16, 16, 72)   288         block_10_project[1][0]           
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 16, 16, 72)   0           block_10_project_BN[1][0]        
__________________________________________________________________________________________________
block_11_expand (Conv2D)        (None, 16, 16, 432)  31104       dropout_11[0][0]                 
__________________________________________________________________________________________________
block_11_expand_BN (BatchNormal (None, 16, 16, 432)  1728        block_11_expand[1][0]            
__________________________________________________________________________________________________
re_lu_22 (ReLU)                 (None, 16, 16, 432)  0           block_11_expand_BN[1][0]         
__________________________________________________________________________________________________
block_11_depthwise (DepthwiseCo (None, 16, 16, 432)  3888        re_lu_22[0][0]                   
__________________________________________________________________________________________________
block_11_depthwise_BN (BatchNor (None, 16, 16, 432)  1728        block_11_depthwise[1][0]         
__________________________________________________________________________________________________
re_lu_23 (ReLU)                 (None, 16, 16, 432)  0           block_11_depthwise_BN[1][0]      
__________________________________________________________________________________________________
block_11_project (Conv2D)       (None, 16, 16, 72)   31104       re_lu_23[0][0]                   
__________________________________________________________________________________________________
block_11_project_BN (BatchNorma (None, 16, 16, 72)   288         block_11_project[1][0]           
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 16, 16, 72)   0           block_11_project_BN[1][0]        
__________________________________________________________________________________________________
block_11_add (Add)              (None, 16, 16, 72)   0           dropout_12[0][0]                 
                                                                 dropout_11[0][0]                 
__________________________________________________________________________________________________
block_12_expand (Conv2D)        (None, 16, 16, 432)  31104       block_11_add[1][0]               
__________________________________________________________________________________________________
block_12_expand_BN (BatchNormal (None, 16, 16, 432)  1728        block_12_expand[1][0]            
__________________________________________________________________________________________________
re_lu_24 (ReLU)                 (None, 16, 16, 432)  0           block_12_expand_BN[1][0]         
__________________________________________________________________________________________________
block_12_depthwise (DepthwiseCo (None, 16, 16, 432)  3888        re_lu_24[0][0]                   
__________________________________________________________________________________________________
block_12_depthwise_BN (BatchNor (None, 16, 16, 432)  1728        block_12_depthwise[1][0]         
__________________________________________________________________________________________________
re_lu_25 (ReLU)                 (None, 16, 16, 432)  0           block_12_depthwise_BN[1][0]      
__________________________________________________________________________________________________
block_12_project (Conv2D)       (None, 16, 16, 72)   31104       re_lu_25[0][0]                   
__________________________________________________________________________________________________
block_12_project_BN (BatchNorma (None, 16, 16, 72)   288         block_12_project[1][0]           
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 16, 16, 72)   0           block_12_project_BN[1][0]        
__________________________________________________________________________________________________
block_12_add (Add)              (None, 16, 16, 72)   0           dropout_13[0][0]                 
                                                                 block_11_add[1][0]               
__________________________________________________________________________________________________
block_13_expand (Conv2D)        (None, 16, 16, 432)  31104       block_12_add[1][0]               
__________________________________________________________________________________________________
block_13_expand_BN (BatchNormal (None, 16, 16, 432)  1728        block_13_expand[1][0]            
__________________________________________________________________________________________________
re_lu_26 (ReLU)                 (None, 16, 16, 432)  0           block_13_expand_BN[1][0]         
__________________________________________________________________________________________________
block_13_pad (ZeroPadding2D)    (None, 17, 17, 432)  0           re_lu_26[0][0]                   
__________________________________________________________________________________________________
block_13_depthwise (DepthwiseCo (None, 8, 8, 432)    3888        block_13_pad[1][0]               
__________________________________________________________________________________________________
block_13_depthwise_BN (BatchNor (None, 8, 8, 432)    1728        block_13_depthwise[1][0]         
__________________________________________________________________________________________________
re_lu_27 (ReLU)                 (None, 8, 8, 432)    0           block_13_depthwise_BN[1][0]      
__________________________________________________________________________________________________
block_13_project (Conv2D)       (None, 8, 8, 120)    51840       re_lu_27[0][0]                   
__________________________________________________________________________________________________
block_13_project_BN (BatchNorma (None, 8, 8, 120)    480         block_13_project[1][0]           
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 8, 8, 120)    0           block_13_project_BN[1][0]        
__________________________________________________________________________________________________
block_14_expand (Conv2D)        (None, 8, 8, 720)    86400       dropout_14[0][0]                 
__________________________________________________________________________________________________
block_14_expand_BN (BatchNormal (None, 8, 8, 720)    2880        block_14_expand[1][0]            
__________________________________________________________________________________________________
re_lu_28 (ReLU)                 (None, 8, 8, 720)    0           block_14_expand_BN[1][0]         
__________________________________________________________________________________________________
block_14_depthwise (DepthwiseCo (None, 8, 8, 720)    6480        re_lu_28[0][0]                   
__________________________________________________________________________________________________
block_14_depthwise_BN (BatchNor (None, 8, 8, 720)    2880        block_14_depthwise[1][0]         
__________________________________________________________________________________________________
re_lu_29 (ReLU)                 (None, 8, 8, 720)    0           block_14_depthwise_BN[1][0]      
__________________________________________________________________________________________________
block_14_project (Conv2D)       (None, 8, 8, 120)    86400       re_lu_29[0][0]                   
__________________________________________________________________________________________________
block_14_project_BN (BatchNorma (None, 8, 8, 120)    480         block_14_project[1][0]           
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 8, 8, 120)    0           block_14_project_BN[1][0]        
__________________________________________________________________________________________________
block_14_add (Add)              (None, 8, 8, 120)    0           dropout_15[0][0]                 
                                                                 dropout_14[0][0]                 
__________________________________________________________________________________________________
block_15_expand (Conv2D)        (None, 8, 8, 720)    86400       block_14_add[1][0]               
__________________________________________________________________________________________________
block_15_expand_BN (BatchNormal (None, 8, 8, 720)    2880        block_15_expand[1][0]            
__________________________________________________________________________________________________
re_lu_30 (ReLU)                 (None, 8, 8, 720)    0           block_15_expand_BN[1][0]         
__________________________________________________________________________________________________
block_15_depthwise (DepthwiseCo (None, 8, 8, 720)    6480        re_lu_30[0][0]                   
__________________________________________________________________________________________________
block_15_depthwise_BN (BatchNor (None, 8, 8, 720)    2880        block_15_depthwise[1][0]         
__________________________________________________________________________________________________
re_lu_31 (ReLU)                 (None, 8, 8, 720)    0           block_15_depthwise_BN[1][0]      
__________________________________________________________________________________________________
block_15_project (Conv2D)       (None, 8, 8, 120)    86400       re_lu_31[0][0]                   
__________________________________________________________________________________________________
block_15_project_BN (BatchNorma (None, 8, 8, 120)    480         block_15_project[1][0]           
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 8, 8, 120)    0           block_15_project_BN[1][0]        
__________________________________________________________________________________________________
block_15_add (Add)              (None, 8, 8, 120)    0           dropout_16[0][0]                 
                                                                 block_14_add[1][0]               
__________________________________________________________________________________________________
block_16_expand (Conv2D)        (None, 8, 8, 720)    86400       block_15_add[1][0]               
__________________________________________________________________________________________________
block_16_expand_BN (BatchNormal (None, 8, 8, 720)    2880        block_16_expand[1][0]            
__________________________________________________________________________________________________
re_lu_32 (ReLU)                 (None, 8, 8, 720)    0           block_16_expand_BN[1][0]         
__________________________________________________________________________________________________
block_16_depthwise (DepthwiseCo (None, 8, 8, 720)    6480        re_lu_32[0][0]                   
__________________________________________________________________________________________________
block_16_depthwise_BN (BatchNor (None, 8, 8, 720)    2880        block_16_depthwise[1][0]         
__________________________________________________________________________________________________
re_lu_33 (ReLU)                 (None, 8, 8, 720)    0           block_16_depthwise_BN[1][0]      
__________________________________________________________________________________________________
block_16_project (Conv2D)       (None, 8, 8, 240)    172800      re_lu_33[0][0]                   
__________________________________________________________________________________________________
block_16_project_BN (BatchNorma (None, 8, 8, 240)    960         block_16_project[1][0]           
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 8, 8, 240)    0           block_16_project_BN[1][0]        
__________________________________________________________________________________________________
Conv_1 (Conv2D)                 (None, 8, 8, 1280)   307200      dropout_17[0][0]                 
__________________________________________________________________________________________________
Conv_1_bn (BatchNormalization)  (None, 8, 8, 1280)   5120        Conv_1[1][0]                     
__________________________________________________________________________________________________
re_lu_34 (ReLU)                 (None, 8, 8, 1280)   0           Conv_1_bn[1][0]                  
==================================================================================================
Total params: 1,382,064
Trainable params: 1,355,424
Non-trainable params: 26,640
__________________________________________________________________________________________________
